loadtest/JMeter Strees Tests/Test Plan 3/ThinkTime.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan 3">
      <stringProp name="TestPlan.comments">Un usuario Edita un articulo</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">2500</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager">
          <collectionProp name="CookieManager.cookies">
            <elementProp name="csrftoken" elementType="Cookie" testname="csrftoken">
              <stringProp name="Cookie.value">${Token_g1}</stringProp>
              <boolProp name="Cookie.secure">false</boolProp>
              <longProp name="Cookie.expires">0</longProp>
              <boolProp name="Cookie.path_specified">true</boolProp>
              <boolProp name="Cookie.domain_specified">true</boolProp>
            </elementProp>
          </collectionProp>
          <boolProp name="CookieManager.clearEachIteration">true</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">true</boolProp>
        </CookieManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Get Administrador Articulos">
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">articles/</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers"/>
          </HeaderManager>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Regular Expression Extractor" enabled="false">
            <stringProp name="RegexExtractor.useHeaders">true</stringProp>
            <stringProp name="RegexExtractor.refname">Token</stringProp>
            <stringProp name="RegexExtractor.regex">csrftoken=(.*?); expires</stringProp>
            <stringProp name="RegexExtractor.template">$1</stringProp>
            <stringProp name="RegexExtractor.default">NONE</stringProp>
            <boolProp name="RegexExtractor.default_empty_value">false</boolProp>
          </RegexExtractor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Get Articulo 969">
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">articles/editar/969/</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers"/>
          </HeaderManager>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Regular Expression Extractor">
            <stringProp name="RegexExtractor.useHeaders">true</stringProp>
            <stringProp name="RegexExtractor.refname">Token</stringProp>
            <stringProp name="RegexExtractor.regex">csrftoken=(.*?); expires</stringProp>
            <stringProp name="RegexExtractor.template">$1</stringProp>
            <stringProp name="RegexExtractor.default">NONE</stringProp>
            <boolProp name="RegexExtractor.default_empty_value">false</boolProp>
          </RegexExtractor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Post Resumir">
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">resumir/</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="csrfmiddlewaretoken" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${Token_g1}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">csrfmiddlewaretoken</stringProp>
              </elementProp>
              <elementProp name="title" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">Agricultura+digital:+una+transformación+clave+en+Chile</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">title</stringProp>
              </elementProp>
              <elementProp name="link" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">https://www.portalagrochile.cl/2024/05/27/agricultura-digital-una-transformacion-clave-en-chile/</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">link</stringProp>
              </elementProp>
              <elementProp name="content" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">La+Agricultura+Digital+se+refiere+al+conjunto+de+buenas+prácticas+y+uso+de+recursos+tecnológicos+para+la+optimización+de+los+procesos+agrícolas,+generando+conocimiento+y+valor+para+quienes+se+dedican+a+esta+tarea.+Se+trabaja+en+un+equilibrio+entre+innovación,+productos+digitales+y+soluciones+resolutivas+en+cuanto+al+análisis+de+datos+para+el+buen+trabajo+en+el+campo,+avanzando+hacia+una+actividad+sustentable.“Desde+sus+inicios+la+agricultura+ha+generado+gran+cantidad+de+datos.+Sin+embargo,+la+mayor+parte+de+ellos+permanecían+subutilizados.+Hoy+en+día,+las+herramientas+digitales+permiten+que+los+agricultores+accedan+a+esta+información+y,+de+esta+forma,+puedan+aprovechar+las+oportunidades+sin+precedentes+que+genera+para+aplicar+mejoras+que+impacten+positivamente+en+la+producción+agrícola”,+señala+Fernando+González,+Product+Manager+de+Agricultura+de+Precisión+de+Salfa.Esta+concepción+de+la+agricultura+se+vale+de+avances+como+sensores+remotos,+drones,+GPS+y+dispositivos+de+seguimiento+para+recopilar+datos+de+los+equipos+en+tiempo+real.+Un+ejemplo+de+las+nuevas+herramientas+digitales+es+el+uso+de+sensores+IoT+(Internet+of+Things)+con+el+cual+es+posible+medir+humedad,+temperatura,+riego+y+luminosidad.++Otro+de+los+alcances+es+el+análisis+de+datos+gracias+a+plataformas+especializadas,+que+aprovechan+la+información+que+proviene+de+los+sensores,+indicadores+meteorológicos+e+historial+de+comportamiento+del+equipo,+que+permiten+realizar+diagnósticos+específicos+para+tomar+decisiones+en+tiempo+real.Además,+la+agricultura+digital+contribuye+a+la+optimización+de+recursos+naturales+como+el+agua+o+el+uso+de+la+tierra+mediante+las+tecnologías+que+estudian+las+variables+ambientales.+“Mientras+los+sistemas+de+detección+en+el+campo+y+los+datos+generados+proporcionan+mejor+información+para+tomar+decisiones+oportunas,+la+automatización+de+tareas+puede+aumentar+la+fiabilidad+de+los+procesos+e+incrementar+su+rentabilidad”,+indica+Fernando+González,+Product+Manager+de+Agricultura+de+Precisión+de+Salfa.Según+el+experto,+los+desafíos+para+este+cambio+pasan+por+el+constante+acompañamiento+que+deben+brindar+a+los+agricultores,+ya+que+la+barrera+principal+es+cultural+y+de+conectividad+en+zonas+rurales.+Sin+embargo,+una+vez+que+está+el+interés,+la+adopción+es+natural+y+gradual.La+experiencia+de+SalfaLos+clientes+de+Salfa+pueden+acceder+a+la+agricultura+digital+a+través+de+la+plataforma+gratuita+Operations+Center+de+John+Deere,+acompañado+de+capacitaciones+del+equipo+de+Agricultura+Digital+y+la+tecnología+de+las+máquinas+de+agricultura+de+precisión+para+su+óptimo+uso+en+el+campo.+Cabe+acotar+que+estas+tecnologías+de+agricultura+digital+de+John+Deere+son+compatibles+para+todas+las+marcas+de+maquinaria.John+Deere+es+una+de+las+marcas+líderes+en+la+Agricultura+de+Precisión+gracias+a+su+amplia+gama+de+tractores+y+maquinaria+equipados+con+tecnología+de+última+generación.+El+Sistema+de+Gestión+Agrícola+(AMS)+ayuda+a+los+agricultores+a+gestionar+sus+operaciones+de+forma+más+eficiente+y+eficaz.+Incluye+componentes+como+receptores+de+posición+para+determinar+la+ubicación+del+tractor,+sistema+de+guiado+y+herramientas+de+gestión+de+datos.Desde+Salfa+también+destacan+la+comunicación+ISOBUS+entre+los+distintos+implementos+agrícolas+y+tractores.+Esto+permite+obtener+datos+de+las+labores+ejecutadas+por+cada+uno+de+ellos,+beneficio+que+impacta+en+la+toma+de+decisiones.</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">content</stringProp>
              </elementProp>
              <elementProp name="summary-TOTAL_FORMS" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">summary-TOTAL_FORMS</stringProp>
              </elementProp>
              <elementProp name="summary-INITIAL_FORMS" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">summary-INITIAL_FORMS</stringProp>
              </elementProp>
              <elementProp name="summary-MIN_NUM_FORMS" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">0</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">summary-MIN_NUM_FORMS</stringProp>
              </elementProp>
              <elementProp name="summary-MAX_NUM_FORMS" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">summary-MAX_NUM_FORMS</stringProp>
              </elementProp>
              <elementProp name="summary-0-summary" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${Token_g1}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">summary-0-summary</stringProp>
              </elementProp>
              <elementProp name="summary-0-article" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">969</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">summary-0-article</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers"/>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">C:\Users\alvar\Desktop\JMeter Test\Test PLan 3\Results Tree.jmx</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">C:\Users\alvar\Desktop\JMeter Test\Test PLan 3\Response Time Graph.jmx</stringProp>
          <stringProp name="RespTimeGraph.interval">100</stringProp>
        </ResultCollector>
        <hashTree/>
        <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Debug Sampler" enabled="false">
          <boolProp name="displayJMeterProperties">false</boolProp>
          <boolProp name="displayJMeterVariables">true</boolProp>
          <boolProp name="displaySystemProperties">false</boolProp>
        </DebugSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>